1s/ERP/Conf/Documents/Лико_ЗаявкаНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_РезервПодЗаявкуНаСклад</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_Срочность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоНаработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОпераций_ПередачаСоСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусЗаявокНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРемонтРЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренняяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРаскрой</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПравилаПеремещенияТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_РезервПодЗаявкуНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_РезервПодЗаявкуНаСклад</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаСклад</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаявкаНаСклад</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ОшибкиПравилПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ОшибкиПравилПеремещенияТМЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПравилаПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияПоПравилу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресХраненияНовый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользоватьПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ДокументыПеремещения</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ВозвратНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ВозвратНаСклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПоАктуРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаОтветсвенноеХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусЗаявокНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусЗаявокНаСклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоРаспоряжению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаДругойСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаСклад/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства;
	КонецЕсли;	
КонецПроцедуры


Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ЗаполнениеСотрудникаВЗаявке",Ложь) Тогда
		Сотрудник=АвторДокумента;
	КонецЕсли; 
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
КонецПроцедуры
                                                  


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		
		Если Не ДополнительныеСвойства.Свойство("УстановитьСтатусзаявки") Тогда			
			Справочники.Лико_ПравилаПеремещенияТМЦ.ВыполнитьПроверку(ЭтотОбъект,Отказ);
		КонецЕсли;
		
		н=0;
		Если Проведен=Ложь И Не ВозвратНаСклад Тогда	

			Для каждого Товар Из Товары Цикл

				ОстатокНаскладе=ПолучитьОстатокНаСкладе2(Товар.Серия,Товар.АдресХранения.Владелец);
				Если Товар.КоличествоУпаковок>ОстатокНаскладе Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не хватает на складе номенклатуры:"+Товар.Серия +"! Остаток на складе:"+ОстатокНаскладе;
					Сообщение.Поле = "Товары["+н+"].КоличествоУпаковок"; //имя реквизита 
					Сообщение.УстановитьДанные(ЭтотОбъект); //Ссылка на объект ИБ
					Сообщение.Сообщить();
					Отказ=Истина;	
				КонецЕсли;


				н=н+1;

			КонецЦикла;
		КонецЕсли;	
		// --> Начало Лико Субботин 21.03.2023 	
		Если Не ДополнительныеСвойства.Свойство("УстановитьСтатусзаявки") Тогда
			
			//Отказ = ПроверкаСвязьЦеновыхГруппСЗаказом(отказ);  
		КонецЕсли;
		// <-- Конец Лико Субботин 21.03.2023 
		Если Не Отказ Тогда
			УстановитьСтатус();
		КонецЕсли;

	Иначе
		Передача=НайтиПередачу();
		Если ЗначениеЗаполнено(Передача) Тогда
			Если  РольДоступна("АдминистраторСистемы") Или РольДоступна("Лико_РедактированиеКоличестоУУ") Тогда
			Иначе

				Отказ=Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Нельзя отменить заявку т.к. она уже обработана складом!";
				Сообщение.Сообщить();
				Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Отменен;	

			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

	лПартнер=?(ЗначениеЗаполнено(ЗаказКлиента),ЗаказКлиента.Партнер,ЗаказНаРаскрой.Партнер);

	Документы.Лико_УстановкаРезерваМатериалов.ПроверкаРезерваМатериалов(Отказ,РежимЗаписи,лПартнер,Товары);


КонецПроцедуры



Функция ПроверкаСвязьЦеновыхГруппСЗаказом(отказ) // Субботин 21.03.23   

	Если отказ ИЛИ ВозвратНаСклад Тогда
		Возврат отказ;
	КонецЕсли;
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	Лико_ЗаявкаНаСкладТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.Лико_ЗаявкаНаСклад.Товары КАК Лико_ЗаявкаНаСкладТовары
	|ГДЕ
	|	Лико_ЗаявкаНаСкладТовары.Ссылка = &Ссылка
	|	И (Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.Лак)
	|			ИЛИ Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.клей)
	|			ИЛИ Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.праймер)
	|			ИЛИ Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа.Лико_ВидТМЦ = ЗНАЧЕНИЕ(Справочник.Лико_ВидыТМЦ.краска))
	|	И Лико_ЗаявкаНаСкладТовары.Номенклатура.ЦеноваяГруппа.Лико_РасчетКакОсновнойКраски = ЛОЖЬ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Если не РезультатЗапроса.Пустой() Тогда 
		Если не ЗначениеЗаполнено(ЗаказКлиента) Тогда 
			отказ = истина;  
			Сообщить("Необходимо заполнить заказ клиента"); 
		Иначе  
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
				Если ЦеноваяГруппаНеСодержитсяВЗаказе(Выборка.ЦеноваяГруппа) Тогда
					Отказ = Истина;
					Сообщить(СтрШаблон("В заявке содержится номенклатура %1 с ценовой группой,  которой нет в указанном заказе, откорректируйте данные заказа", Выборка.Номенклатура));

				КонецЕсли;
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;

	Возврат Отказ	

КонецФункции


Функция ПолучитьОстатокНаСкладе2(лСерия,лСклад)
	лКоличество=0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Ячейка.Владелец = &Склад И Ячейка.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.СИМ)) КАК ТоварыВЯчейкахОстатки";
	Запрос.УстановитьПараметр("Номенклатура", лСерия.ЯССМ_ОбъектНоменклатуры.Номенклатура);
	Запрос.УстановитьПараметр("Склад",лСклад );

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		лКоличество=Выборка.Остаток;	
	КонецЦикла; 

	Возврат лКоличество;


КонецФункции



Функция ЦеноваяГруппаНеСодержитсяВЗаказе(ЦеноваяГруппа) // Субботин 21.03.23
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаЦвета.ТипКраски КАК ЦеноваяГруппа
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Клей ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ЗаказКлиентаВидыРабот.Клей.ЦеноваяГруппа
		|		КОГДА ЗаказКлиентаВидыРабот.Клей ССЫЛКА Справочник.ЦеновыеГруппы
		|			ТОГДА ЗаказКлиентаВидыРабот.Клей
		|	КОНЕЦ
		|ИЗ
		|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦеноваяГруппа");  
	
	
   	Возврат  РезультатЗапроса.Найти(ЦеноваяГруппа) = Неопределено
	
	
КонецФункции 
 

Процедура УстановитьСтатус() //+Лико m.shenderov 05.11.2018
	Передача=НайтиПередачу();
	
	
	Если Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Отменен Тогда
		
		
		Если ЗначениеЗаполнено(Передача) ТОгда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя отменить заявку т.к. она уже обработана складом!";
			Сообщение.Сообщить();	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Передача) Тогда
		Если Передача.Проведен и  НЕ ДополнительныеСвойства.Свойство("УдалениеДОкументаПоЗаявке") Тогда
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Выдан;	
		Иначе
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Подготовлен;
		КонецЕсли;
	Иначе
		Статус=Перечисления.Лико_СтатусЗаявокНаСклад.ВОбработке;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 05.11.2018

Функция НайтиПередачу() //+Лико m.shenderov 05.11.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.ЗаявкаНаСклад = &Ссылка
	|	И НЕ Лико_ПередачаТоваров.ПометкаУдаления
	|	И Лико_ПередачаТоваров.ЗаявкаНаСклад <> ЗНАЧЕНИЕ(Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_ВозвратТоваров.Ссылка
	|ИЗ
	|	Документ.Лико_ВозвратТоваров КАК Лико_ВозвратТоваров
	|ГДЕ
	|	Лико_ВозвратТоваров.ЗаявкаНаСклад = &Ссылка
	|	И НЕ Лико_ВозвратТоваров.ПометкаУдаления
	|	И Лико_ВозвратТоваров.ЗаявкаНаСклад <> ЗНАЧЕНИЕ(Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 05.11.2018 



Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;

	ЕстьЗапчасть=Ложь;
	Для каждого Товар Из Товары Цикл

		Если Товар.Номенклатура.ВидНоменклатуры=Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыЗапчасти.ЗначениеПараметра Тогда

			ЕстьЗапчасть=Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	//
	//Если Не ЕстьЗапчасть Тогда 		
	//	МассивНепроверяемыхРеквизитов.Добавить("РабочийЦентр"); 
	//КонецЕсли;

	Если (Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Или
		Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияИксПак.ЗначениеПараметра) И  Не ВозвратНаСклад ТОгда
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("РабочийЦентр"); 

	КонецЕсли;

	Если ВозвратНаСклад Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.АдресХранения"); 
		МассивНепроверяемыхРеквизитов.Добавить("Товары.Серия"); 

	КонецЕсли;


	Если ВозвратНаСклад Тогда
		ПроверяемыеРеквизиты.Добавить("Комментарий");
	КонецЕсли;
	
	Если ВидОперации=Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение 
		Или ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа
		Или ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РабочийЦентр");
	КонецЕсли;
	
	Если  ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Продажа
		Или ВидОперации = Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПереработку Тогда
		
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("Партнер"); 
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");


	КонецЕсли;
	
	Если  ВидОперации <> Перечисления.Лико_ВидыОпераций_ПередачаСоСклада.Перемещение Тогда 		
		  МассивНепроверяемыхРеквизитов.Добавить("Адрес");
	КонецЕсли;
	

	


	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	//ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	//ПараметрыПроверки.ИмяТЧ = "Товары";
	//ПараметрыПроверки.СуффиксДопРеквизита = "";
	//ПараметрыПроверки.ПроверитьВозможностьОкругления = Ложь;
	//ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ,ПараметрыПроверки);


КонецПроцедуры


Функция ПолучитьОстатокНаСкладе(Серия) //+Лико m.shenderov 10.03.2020
	лКоличество=0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Ячейка.Владелец = &Склад И Ячейка.Помещение.Лико_ТипСклада = ЗНАЧЕНИЕ(Перечисление.Лико_ТипСклада.СИМ)) КАК ТоварыВЯчейкахОстатки";
	Запрос.УстановитьПараметр("Номенклатура", Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		лКоличество=Выборка.Остаток;	
	КонецЦикла; 
	
	Возврат лКоличество;
	
	
КонецФункции //-Лико m.shenderov 10.03.2020 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РегистрыСведений.Лико_РезервПодЗаявкуНаСклад.Проведение(ЭтотОбъект);
	РегистрыСведений.Лико_ОшибкиПравилПеремещенияТМЦ.СформироватьЗаписиЗаявкаНаСклад(ЭтотОбъект,Отказ);
	Документы.Лико_ЗаданиеНаОтборРазмещение.ОбработатьЗадание(Ссылка);
КонецПроцедуры
